{"format": "layers-model", "generatedBy": "keras v2.20.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.20.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "bilstm_autoencoder", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "encoder_bilstm1", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "encoder_lstm1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}, "name": "encoder_bilstm1", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "encoder_dropout1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "encoder_dropout1", "inbound_nodes": [[["encoder_bilstm1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "encoder_bilstm2", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "encoder_lstm2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}, "name": "encoder_bilstm2", "inbound_nodes": [[["encoder_dropout1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "encoder_dropout2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "encoder_dropout2", "inbound_nodes": [[["encoder_bilstm2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "latent", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "latent", "inbound_nodes": [[["encoder_dropout2", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "decoder_repeat", "trainable": true, "dtype": "float32", "n": 60}, "name": "decoder_repeat", "inbound_nodes": [[["latent", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "decoder_bilstm1", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "decoder_lstm1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}, "name": "decoder_bilstm1", "inbound_nodes": [[["decoder_repeat", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "decoder_dropout1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "decoder_dropout1", "inbound_nodes": [[["decoder_bilstm1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "decoder_bilstm2", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "decoder_lstm2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null}, "merge_mode": "concat"}, "name": "decoder_bilstm2", "inbound_nodes": [[["decoder_dropout1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "decoder_dropout2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "decoder_dropout2", "inbound_nodes": [[["decoder_bilstm2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "decoder_output", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}}}, "name": "decoder_output", "inbound_nodes": [[["decoder_dropout2", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0]], "output_layers": [["decoder_output", 0, 0]]}}, "training_config": {"loss": "mse", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mae", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0001250000059371814, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "decoder_bilstm1/forward_decoder_lstm1/lstm_cell/kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "decoder_bilstm1/forward_decoder_lstm1/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "decoder_bilstm1/forward_decoder_lstm1/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "decoder_bilstm1/backward_decoder_lstm1/lstm_cell/kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "decoder_bilstm1/backward_decoder_lstm1/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "decoder_bilstm1/backward_decoder_lstm1/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "decoder_bilstm2/forward_decoder_lstm2/lstm_cell/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "decoder_bilstm2/forward_decoder_lstm2/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "decoder_bilstm2/forward_decoder_lstm2/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "decoder_bilstm2/backward_decoder_lstm2/lstm_cell/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "decoder_bilstm2/backward_decoder_lstm2/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "decoder_bilstm2/backward_decoder_lstm2/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "decoder_output/kernel", "shape": [128, 16], "dtype": "float32"}, {"name": "decoder_output/bias", "shape": [16], "dtype": "float32"}, {"name": "encoder_bilstm1/forward_encoder_lstm1/lstm_cell/kernel", "shape": [16, 256], "dtype": "float32"}, {"name": "encoder_bilstm1/forward_encoder_lstm1/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "encoder_bilstm1/forward_encoder_lstm1/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "encoder_bilstm1/backward_encoder_lstm1/lstm_cell/kernel", "shape": [16, 256], "dtype": "float32"}, {"name": "encoder_bilstm1/backward_encoder_lstm1/lstm_cell/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "encoder_bilstm1/backward_encoder_lstm1/lstm_cell/bias", "shape": [256], "dtype": "float32"}, {"name": "encoder_bilstm2/forward_encoder_lstm2/lstm_cell/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "encoder_bilstm2/forward_encoder_lstm2/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "encoder_bilstm2/forward_encoder_lstm2/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "encoder_bilstm2/backward_encoder_lstm2/lstm_cell/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "encoder_bilstm2/backward_encoder_lstm2/lstm_cell/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "encoder_bilstm2/backward_encoder_lstm2/lstm_cell/bias", "shape": [128], "dtype": "float32"}, {"name": "latent/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "latent/bias", "shape": [32], "dtype": "float32"}]}]}